# GetBoundaryLines Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
IFCLegacyStairOrRamp..::..GetBoundaryLines Method
IFCLegacyStairOrRamp Class See Also
---
Gets boundary lines.
**Namespace:** Autodesk.Revit.DB.IFC**Assembly:** RevitAPIIFC (in RevitAPIIFC.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2015
# Syntax
C#
---
```text
public IList<CurveLoop> GetBoundaryLines()
```

Visual Basic
---
```text
Public Function GetBoundaryLines As IList(Of CurveLoop)
```

Visual C++
---
```text
public:
IList<CurveLoop^>^ GetBoundaryLines()
```

# ### Return Value
The boundary lines.
# See Also
IFCLegacyStairOrRamp Class
Autodesk.Revit.DB.IFC Namespace